Autodesk.Revit.DB.IConnector.Radius
The radius of the connector.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the connector's shape is not round.
Remarks: This property is used to retrieve the radius of the connector.

Autodesk.Revit.DB.IConnector.Height
The height of the connector.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the connector's shape is not rectangular.
Remarks: This property is used to retrieve the height of the connector.

Autodesk.Revit.DB.IConnector.Width
The width of the connector.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the connector's shape is not rectangular.
Remarks: This property is used to retrieve the width of the connector.

Autodesk.Revit.DB.IConnector.Shape
The shape of the connector.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Throw when this connector has no shape.
Remarks: This property is used to retrieve the shape of the connector.

Autodesk.Revit.DB.IConnector.Domain
The domain of the connector.
Remarks: This property is used to retrieve the domain of the connector.

Autodesk.Revit.DB.IConnector.Origin
The location of the connector in family document.
Remarks: This property is used to retrieve the origin of the connector.

Autodesk.Revit.DB.IConnector.CoordinateSystem
The coordinate system of the connector.
Remarks: The Z axis of the coordinate system is the normal to the plane of the connector.

Autodesk.Revit.DB.IConnector
An interface which provides access to connector in Autodesk Revit MEP document.
Remarks: This interface is shared by Connector,
ConnectorElement.